uhnp/src/InformationRegisters/АналитикаПланированияПотребностей/АналитикаПланированияПотребностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АналитикаПланированияПотребностей</name>
  <resources>
    <name>КлючАналитики</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияПотребностей</types>
    </type>
  </resources>
  <dimensions>
    <name>МестоПоставки</name>
    <type>
      <types>CatalogRef.МестаПоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.ПриоритетыПотребностей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Менеджер</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Catalogs/КлючиАналитикиПланированияПотребностей/КлючиАналитикиПланированияПотребностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлючиАналитикиПланированияПотребностей</name>
  <attributes>
    <name>МестоПоставки</name>
    <type>
      <types>CatalogRef.МестаПоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.ПриоритетыПотребностей</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/InformationRegisters/АналитикаПланированияПотребностей/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Функция возвращает информацию о ключе
Функция ИнформацияОКлюче() Экспорт

	//
	Результат = Новый Структура;
	Результат.Вставить("СправочникИмя", "КлючиАналитикиПланированияПотребностей");
	Результат.Вставить("СправочникМенеджер", Справочники.КлючиАналитикиПланированияПотребностей);
	Результат.Вставить("СправочникМетаданные", Метаданные.Справочники.КлючиАналитикиПланированияПотребностей);
	Результат.Вставить("РегистрИмя", "АналитикаПланированияПотребностей");
	Результат.Вставить("РегистрМенеджер", РегистрыСведений.АналитикаПланированияПотребностей);
	Результат.Вставить("РегистрМетаданные", Метаданные.РегистрыСведений.АналитикаПланированияПотребностей);
	
	Результат.Вставить("ИмяПоляАналитика", "АналитикаПланированияПотребностей");
	
	КонтрольУХКлючи.ДобавитьИзмеренияКлюча(Результат);
	
	Возврат Результат;
	
КонецФункции

// Возвращает наименование ключа
Функция ПолучитьПолноеНаименованиеКлючаАналитики(МенеджерЗаписи) Экспорт
	
	Поля = Новый Массив;
	Поля.Добавить(СокрЛП(МенеджерЗаписи.МестоПоставки));
	Поля.Добавить(СокрЛП(МенеджерЗаписи.Приоритет));
	Если ЗначениеЗаполнено(МенеджерЗаписи.Менеджер) Тогда
		Поля.Добавить(СокрЛП(МенеджерЗаписи.Менеджер));
	КонецЕсли;
	Если ЗначениеЗаполнено(МенеджерЗаписи.Назначение) Тогда
		Поля.Добавить(СокрЛП(МенеджерЗаписи.Назначение));
	КонецЕсли;
	Возврат СтрСоединить(Поля, "; ");
	
КонецФункции

// Функция получает элемент справочника - ключ аналитики планирования потребностей.
//
// Параметры:
//	ПараметрыАналитики     - Выборка, Структура - Содержит полями "МестоПоставки, Приоритет, Менеджер, Назначение":
//		* МестоПоставки    - СправочникСсылка.МестаПоставки
//		* Приоритет        - СправочникСсылка.ПриоритетыПотребностей
//		* Менеджер         - СправочникСсылка.ФизическиеЛица
//		* Назначение	   - СправочникСсылка.ДоговорыКонтрагентов
//
// Возвращаемое значение:
//	СправочникСсылка.КлючиАналитикиПланированияПотребностей - Созданный элемент справочника.
//
Функция ЗначениеКлючаАналитики(ПараметрыАналитики) Экспорт

	КлючАналитики = Неопределено;
	
	НаборЗаписей = ПолучитьНаборЗаписей(ПараметрыАналитики);
	
	Если НаборЗаписей <> Неопределено Тогда
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() > 0
			И Не ЗначениеЗаполнено(НаборЗаписей[0].КлючАналитики) Тогда
			НаборЗаписей.Очистить();
			НаборЗаписей.Записать();
		КонецЕсли;

		Если НаборЗаписей.Количество() > 0
			И ЗначениеЗаполнено(НаборЗаписей[0].КлючАналитики) Тогда
			КлючАналитики = НаборЗаписей[0].КлючАналитики;
		Иначе
			КлючАналитики = СоздатьКлючАналитики(ПараметрыАналитики);
		КонецЕсли;
	Иначе
		КлючАналитики = Справочники.КлючиАналитикиПланированияПотребностей.ПустаяСсылка();
	КонецЕсли;

	Возврат КлючАналитики;
КонецФункции

// Функция получает элемент справочника - ключ аналитики планирования.
//
// Параметры:
//	ПараметрыАналитики - Выборка или Структура  с полями "МестоПоставки, Приоритет, Менеджер, Назначение".
//
// Возвращаемое значение:
//	СправочникСсылка.КлючиАналитикиПланированияПотребностей - Созданный элемент справочника.
//
Функция СоздатьКлючАналитики(ПараметрыАналитики, ЗаписьПриОбновленииИБ = Ложь) Экспорт
	
	Возврат КонтрольУХКлючи.СоздатьКлючАналитики(ИнформацияОКлюче(), ПараметрыАналитики);
	
КонецФункции

// Заполняет поле АналитикаПланированияПотребностей в коллекции, содержащей место поставки, приоритет, менеджер, Назначение.
//
// Параметры:
//
//	Коллекция - ТабличнаяЧасть - Коллекция, в которой производится заполнение аналитики учета потребностей.
//
//	ИменаПолей - Структура - содержит реальные имена полей коллекции для получения и формирования аналитики.
//		содержит две секции, если значение ключа Неопределено, то имя поля берется из имени ключа.
//		секция идентификации {МестоПоставки, Приоритет, Менеджер, Назначение, АналитикаПланированияПотребностей},
//	
//	ПараметрыЗаполнения - Структура - см. метод КонтрольУХКлючи.ПараметрыЗаполненияКлючейАналитики()
//
// Пример 1:
//	ИменаПолей = РегистрыСведений.АналитикаПланированияПотребностей.ИменаПолейКоллекцииПоУмолчанию();
//	РегистрыСведений.АналитикаПланированияПотребностей.ЗаполнитьВКоллекции(ДвиженияОперации, ИменаПолей);
//
// Пример 2:
//	РегистрыСведений.АналитикаПланированияПотребностей.ЗаполнитьВКоллекции(ДвиженияОперации);
//
Процедура ЗаполнитьВКоллекции(Коллекция, 
								ИменаПолей = Неопределено, ДополнитьКлюч = Ложь, ПараметрыЗаполнения = Неопределено) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПараметрыЗаполнения = Неопределено Тогда
		ПараметрыЗаполнения = КонтрольУХКлючи.ПараметрыЗаполненияКлючейАналитики();
	КонецЕсли;
	
	Если ДополнитьКлюч Тогда
		Если ИменаПолей = Неопределено Тогда
			ИменаПолей = ИменаПолейДополненияКоллекцииПоУмолчанию();
		КонецЕсли;
		Запрос = Новый Запрос(ТекстДополнениеКлючейАналитикиВКоллекции(ИменаПолей));
		Запрос.УстановитьПараметр("Коллекция", Коллекция);
	Иначе
		Если ИменаПолей = Неопределено Тогда
			ИменаПолей = ИменаПолейКоллекцииПоУмолчанию();
		КонецЕсли;
		Запрос = Новый Запрос(ТекстЗначенияКлючейАналитикиВКоллекции(ИменаПолей));
		Запрос.УстановитьПараметр("Коллекция", Коллекция);
		
		Если ЗначениеЗаполнено(ИменаПолей.Приоритет)
			И ТипЗнч(ИменаПолей.Приоритет) = Тип("Структура")
			И ИменаПолей.Приоритет.Свойство("Значение") Тогда
			Запрос.УстановитьПараметр("Приоритет", ИменаПолей.Приоритет.Значение);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИменаПолей.Менеджер)
			И ТипЗнч(ИменаПолей.Менеджер) = Тип("Структура")
			И ИменаПолей.Менеджер.Свойство("Значение") Тогда
			Запрос.УстановитьПараметр("Менеджер", ИменаПолей.Менеджер.Значение);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИменаПолей.Назначение)
			И ТипЗнч(ИменаПолей.Назначение) = Тип("Структура")
			И ИменаПолей.Назначение.Свойство("Значение") Тогда
			Запрос.УстановитьПараметр("Назначение", ИменаПолей.Назначение.Значение);
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Не ЗначениеЗаполнено(Выборка.АналитикаПланированияПотребностей) Тогда
			Если ПараметрыЗаполнения.СоздаватьВКлючи Тогда
				КлючАналитики = ЗначениеКлючаАналитики(Выборка);
			Иначе
				ТекстИсключения = НСтр("ru = 'Ошибка при заполнении ключей в коллекции: есть аналитики, по которым ключи еще не созданы.'");
				ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
					УровеньЖурналаРегистрации.Ошибка,
					Метаданные.Справочники.КлючиАналитикиПланированияПотребностей,
					,
					ТекстИсключения);
				ВызватьИсключение ТекстИсключения;
			КонецЕсли;
		Иначе
			КлючАналитики = Выборка.АналитикаПланированияПотребностей;
		КонецЕсли;
		
		ПараметрыЗаполнения.ИзмененаАналитика = Истина;
		Если НЕ ПараметрыЗаполнения.ЗаполнятьКлючВКоллекции Тогда
			Продолжить;
		КонецЕсли;
		
		Если ДополнитьКлюч Тогда
			Коллекция[Выборка.Индекс][ИменаПолей.ЗаполняемаяАналитикаПланированияПотребностей] = КлючАналитики;
		Иначе
			Коллекция[Выборка.Индекс][ИменаПолей.АналитикаПланированияПотребностей] = КлючАналитики;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Возвращает структуру полей выбора информации из коллекции для формирования аналитики планирования потребностей.
//
// Возвращаемое значение:
//	Структура - содержит реальные имена полей коллекции для получения и формирования аналитики.
//		содержит две секции, если значение ключа Неопределено, то имя поля должно браться из имени ключа.
//		секция идентификации {МестоПоставки, Приоритет, Менеджер, Назначение, АналитикаПланированияПотребностей},
//			все ключи заданы.
//
Функция ИменаПолейКоллекцииПоУмолчанию() Экспорт
	
	ИменаПолей = Новый Структура();
	ИменаПолей.Вставить("МестоПоставки",					"МестоПоставки");
	ИменаПолей.Вставить("Приоритет",						"Приоритет");
	ИменаПолей.Вставить("Менеджер",							"Менеджер");
	ИменаПолей.Вставить("Назначение",						"Назначение");
	ИменаПолей.Вставить("АналитикаПланированияПотребностей","АналитикаПланированияПотребностей");
	
	Возврат ИменаПолей;
КонецФункции

// Возвращает структуру полей выбора информации из коллекции для формирования аналитики планирования потребностей.
//
// Возвращаемое значение:
//	Структура - содержит реальные имена полей коллекции для получения и формирования аналитики.
//
Функция ИменаПолейДополненияКоллекцииПоУмолчанию() Экспорт
	
	ИменаПолей = Новый Структура();
	ИменаПолей.Вставить("АналитикаПланированияПотребностей", "АналитикаПланированияПотребностей");
	ИменаПолей.Вставить("ЗаполняемаяАналитикаПланированияПотребностей", "АналитикаПланированияПотребностей");
	ИменаПолей.Вставить("МестоПоставки", "");
	ИменаПолей.Вставить("Приоритет", "");
	ИменаПолей.Вставить("Менеджер", "");
	ИменаПолей.Вставить("Назначение", "");
	
	Возврат ИменаПолей;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Прочее

Функция ПолучитьНаборЗаписей(ПараметрыАналитики)
	
	// В параметрах аналитики могут быть не все свойства
	СтруктураАналитики = Новый Структура("МестоПоставки, Приоритет, Менеджер, Назначение");
	ЗаполнитьЗначенияСвойств(СтруктураАналитики, ПараметрыАналитики);
	Если НЕ ЗначениеЗаполнено(СтруктураАналитики.МестоПоставки) 
	 И НЕ ЗначениеЗаполнено(СтруктураАналитики.Приоритет) Тогда
		Возврат Неопределено
	Иначе
		НаборЗаписей = РегистрыСведений.АналитикаПланированияПотребностей.СоздатьНаборЗаписей();
		
		Для Каждого КлючЗначение Из СтруктураАналитики Цикл
			НаборЗаписей.Отбор[КлючЗначение.Ключ].Установить(КлючЗначение.Значение);
		КонецЦикла;
		
		НоваяСтрока = НаборЗаписей.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураАналитики, "МестоПоставки, Приоритет, Менеджер, Назначение");
		ПроверитьЗаполнениеПоляМестоПоставкиПриоритет(НоваяСтрока);
		Возврат НаборЗаписей;
	КонецЕсли;
	
КонецФункции

Процедура ПроверитьЗаполнениеПоляМестоПоставкиПриоритет(МенеджерЗаписиАналитикаПланированияПотребностей)

	Если МенеджерЗаписиАналитикаПланированияПотребностей.МестоПоставки = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Ошибочное значение параметра ""МестоПоставки""'");
	КонецЕсли;

	Если МенеджерЗаписиАналитикаПланированияПотребностей.Приоритет = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Ошибочное значение параметра ""Приоритет""'");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеКлючейАналитикиВКоллекции

Функция ТекстЗначенияКлючейАналитикиВКоллекции(ИменаПолей)
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Коллекция.НомерСтроки - 1 КАК Индекс,
	|	&ПолеАналитикаПланирования КАК АналитикаПланированияПотребностей,
	|	&ПолеМестоПоставки КАК МестоПоставки,
	|	&ПолеПриоритет КАК Приоритет,
	|	&ПолеМенеджер КАК Менеджер,
	|	&ПолеНазначение КАК Назначение
	|
	|ПОМЕСТИТЬ Коллекция
	|ИЗ &Коллекция КАК Коллекция
	|;
	|
	|ВЫБРАТЬ
	|	Коллекция.Индекс,
	|	Аналитика.КлючАналитики КАК АналитикаПланированияПотребностей,
	|	Коллекция.МестоПоставки,
	|	Коллекция.Приоритет,
	|	Коллекция.Менеджер,
	|	Коллекция.Назначение
	|ИЗ
	|	Коллекция КАК Коллекция
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаПланированияПотребностей КАК Аналитика
	|		ПО Аналитика.МестоПоставки = Коллекция.МестоПоставки
	|		И Аналитика.Приоритет = Коллекция.Приоритет
	|		И Аналитика.Менеджер = Коллекция.Менеджер
	|		И Аналитика.Назначение = Коллекция.Назначение
	|ГДЕ
	|	Аналитика.КлючАналитики ЕСТЬ NULL
	|	ИЛИ Аналитика.КлючАналитики <> Коллекция.АналитикаПланированияПотребностей
	|	ИЛИ Аналитика.КлючАналитики = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиПланированияПотребностей.ПустаяСсылка)";
	
	// заменим в тексте запроса подставляемые поля из структуры ИменаПолей
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеАналитикаПланирования",	"Коллекция." + ИменаПолей.АналитикаПланированияПотребностей);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеМестоПоставки",	"Коллекция." + ИменаПолей.МестоПоставки);

	// Поле Приоритет может отсутствовать в таблице.
	Если ЗначениеЗаполнено(ИменаПолей.Приоритет) Тогда
		Если ТипЗнч(ИменаПолей.Приоритет) = Тип("Структура") Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеПриоритет", ИменаПолей.Приоритет.ТекстПоля);
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеПриоритет", "Коллекция." + ИменаПолей.Приоритет);
		КонецЕсли;  
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеПриоритет", "ЗНАЧЕНИЕ(Справочник.ПриоритетыПотребностей.Обычный)");
	КонецЕсли; 
	
	// Поле Менеджер может отсутствовать в таблице.
	Если ЗначениеЗаполнено(ИменаПолей.Менеджер) Тогда
		Если ТипЗнч(ИменаПолей.Менеджер) = Тип("Структура") Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеМенеджер", ИменаПолей.Менеджер.ТекстПоля);
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеМенеджер", "Коллекция." + ИменаПолей.Менеджер);
		КонецЕсли;  
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеМенеджер", "ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)");
	КонецЕсли; 
	
	// Поле Назначение может отсутствовать в таблице.
	Если ЗначениеЗаполнено(ИменаПолей.Назначение) Тогда
		Если ТипЗнч(ИменаПолей.Назначение) = Тип("Структура") Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеНазначение", ИменаПолей.Назначение.ТекстПоля);
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеНазначение", "Коллекция." + ИменаПолей.Назначение);
		КонецЕсли;  
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеНазначение", "ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)");
	КонецЕсли; 
	
	Возврат ТекстЗапроса;
КонецФункции

Функция ТекстДополнениеКлючейАналитикиВКоллекции(ИменаПолей)
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Коллекция.НомерСтроки - 1 КАК Индекс,
	|	&ПолеАналитика            КАК АналитикаПланированияПотребностей,
	|	&ПолеПриемник             КАК АналитикаПланированияПотребностейПриемник,
	|	&ПолеМестоПоставки		  КАК МестоПоставки,
	|	&ПолеПриоритет			  КАК Приоритет,
	|	&ПолеМенеджер		  	  КАК Менеджер,
	|	&ПолеНазначение		  	  КАК Назначение
	|ПОМЕСТИТЬ ВтКоллекция
	|ИЗ &Коллекция КАК Коллекция
	|;
	|ВЫБРАТЬ
	|	Коллекция.Индекс                       КАК Индекс,
	|	Коллекция.АналитикаПланированияПотребностей КАК АналитикаПланированияПотребностей,
	|	Коллекция.АналитикаПланированияПотребностейПриемник КАК АналитикаПланированияПотребностейПриемник,
	|	ВЫБОР КОГДА Коллекция.МестоПоставки = ЗНАЧЕНИЕ(Справочник.МестаПоставки.ПустаяСсылка)
	|		ТОГДА ЕСТЬNULL(Аналитика.МестоПоставки, ЗНАЧЕНИЕ(Справочник.МестаПоставки.ПустаяСсылка))
	|		ИНАЧЕ Коллекция.МестоПоставки
	|	КОНЕЦ                                КАК МестоПоставки,
	|	ВЫБОР КОГДА Коллекция.Приоритет = ЗНАЧЕНИЕ(Справочник.ПриоритетыПотребностей.ПустаяСсылка)
	|		ТОГДА ЕСТЬNULL(Аналитика.Приоритет, ЗНАЧЕНИЕ(Справочник.ПриоритетыПотребностей.ПустаяСсылка))
	|		ИНАЧЕ Коллекция.Приоритет
	|	КОНЕЦ                                КАК Приоритет,
	|	ВЫБОР КОГДА Коллекция.Менеджер = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|		ТОГДА ЕСТЬNULL(Аналитика.Менеджер, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка))
	|		ИНАЧЕ Коллекция.Менеджер
	|	КОНЕЦ                                КАК Менеджер,
	|	ВЫБОР КОГДА Коллекция.Назначение = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|		ТОГДА ЕСТЬNULL(Аналитика.Назначение, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка))
	|		ИНАЧЕ Коллекция.Назначение
	|	КОНЕЦ                                КАК Назначение
	|ПОМЕСТИТЬ Коллекция
	|ИЗ
	|	ВтКоллекция КАК Коллекция
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаПланированияПотребностей КАК Аналитика
	|	ПО Коллекция.АналитикаПланированияПотребностей = Аналитика.КлючАналитики
	|;
	|ВЫБРАТЬ
	|	Коллекция.Индекс КАК Индекс,
	|	Ключи.КлючАналитики КАК АналитикаПланированияПотребностей,
	|	Коллекция.МестоПоставки КАК МестоПоставки,
	|	Коллекция.Приоритет КАК Приоритет,
	|	Коллекция.Менеджер КАК Менеджер,
	|	Коллекция.Назначение КАК Назначение
	|ИЗ
	|	Коллекция КАК Коллекция
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаПланированияПотребностей КАК Ключи
	|	ПО Ключи.МестоПоставки = Коллекция.МестоПоставки
	|		И Ключи.Приоритет = Коллекция.Приоритет
	|		И Ключи.Менеджер = Коллекция.Менеджер
	|		И Ключи.Назначение = Коллекция.Назначение
	|ГДЕ
	|	Ключи.КлючАналитики ЕСТЬ NULL
	|	ИЛИ Ключи.КлючАналитики <> Коллекция.АналитикаПланированияПотребностей
	|	ИЛИ Коллекция.АналитикаПланированияПотребностейПриемник = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиПланированияПотребностей.ПустаяСсылка)";
	
	// заменим в тексте запроса подставляемые поля из структуры ИменаПолей
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеАналитика", "Коллекция." + ИменаПолей.АналитикаПланированияПотребностей);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеПриемник", "Коллекция." + ИменаПолей.ЗаполняемаяАналитикаПланированияПотребностей);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеМестоПоставки", ?(ЗначениеЗаполнено(ИменаПолей.МестоПоставки),"Коллекция." + ИменаПолей.МестоПоставки, "ЗНАЧЕНИЕ(Справочник.МестаПоставки.ПустаяСсылка)"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеПриоритет", ?(ЗначениеЗаполнено(ИменаПолей.Приоритет),"Коллекция." + ИменаПолей.Приоритет, "ЗНАЧЕНИЕ(Справочник.ПриоритетыПотребностей.ПустаяСсылка)"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеМенеджер", ?(ЗначениеЗаполнено(ИменаПолей.Менеджер),"Коллекция." + ИменаПолей.Менеджер, "ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеНазначение", ?(ЗначениеЗаполнено(ИменаПолей.Назначение),"Коллекция." + ИменаПолей.Назначение, "ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)"));
	
	Возврат ТекстЗапроса;
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
